# UseOutsideAirPerArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..UseOutsideAirPerArea Property
EnergyDataSettings Class See Also
---
True is user is specifying outside air per area, false otherwise.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool UseOutsideAirPerArea { get; set; }
```

Visual Basic
---
```text
Public Property UseOutsideAirPerArea As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UseOutsideAirPerArea {
	bool get ();
	void set (bool value);
}
```

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace